package ru.rut.cnn;

public class Coin {
    public static final String[] CLASS_NAMES = new String[] {"1 рубль", "10 рублей", "2 рубля", "5 рублей"};
    public static final Integer[] PREVIEWS = {R.drawable.one, R.drawable.ten, R.drawable.two, R.drawable.five};

    public final String label;
    public final Integer preview;
    public String info_text;

    public Coin(String label, Integer preview) {
        this.label = label;
        this.preview = preview;
        this.setInfoText();
    }
    private void setInfoText() {
        switch (this.label) {
            case "1 рубль":
                this.info_text = "Слово «рубль» впервые встречается в новгородских грамотах XIII века как эквивалент новгородской гривны — серебряного слитка весом около 200 граммов.\n" +
                        "Первая рублевая монета (с обозначением достоинства словом «рубль») была отчеканена только в 1654 году, в ходе денежной реформы Алексея Михайловича, однако находилась в обращении не более года, поскольку содержание серебра в монете было ниже, чем в ста копейках — фактически новая рублёвая монета равнялась только 64 копейкам.\n" +
                        "Чеканка рублевых монет возобновилась в 1704 году при Петре I и уже не прекращалась (за исключением коротких периодов) до наших дней. Первоначально это были серебряные монеты весом 28 граммов при содержании чистого серебра около 25—26 граммов. К 1764 году это содержание снизилось до 18 граммов и в собственно серебряных рублёвиках периода Российской империи уже не менялось.\n" +
                        "Последние серебряные монеты достоинством один рубль были выпущены уже в СССР в 1924 году и повторяли вес и пробу царских рублёвиков. 1 января 1961 года в обращение были выпущены рублёвые монеты уже не из драгоценного металла, а из сплава на основе никеля. Современные рублёвые монеты, являющиеся законным средством платежа на территории Российской Федерации, изготовлены из медно-никелевого сплава диаметром 20,5 мм, толщиной 1,5 мм, весом 3,25 грамма, гурт имеет 110 рифлений.\n";
                break;
            case "2 рубля":
                this.info_text = "Впервые 2 рубля были выпущены в России в 1718 году в виде золотых монет. На них были изображены Пётр I и Андрей Первозванный. Далее они выпускались при Екатерине I и Петре II, а также при Екатерине II для дворцового обихода. \n" +
                        "После денежной реформы 1997 года в России были выпущены монеты номиналом 2 рубля из медно-никелевого сплава, с 2009 года монеты стали чеканить из стали с никелевым гальванопокрытием.\n";
                break;
            case "5 рублей":
                this.info_text = "Впервые в России пять рублей чеканили в 1755 году при Елизавете Петровне. После этого монета чеканилась при всех российских императорах.\n" +
                        "Содержание золота в монете менялось. При Елизавете Петровне выпускались монеты 917-й пробы. Павел I повысил содержание золота в монете до 986-й пробы. В 1818 году выпущена монета пять рублей 917-й пробы, с масонским гербом. Император Александр III понизил содержание золота в монете до 900-й пробы; в дальнейшем качество монет не менялось. \n" +
                        "В Советском Союзе в серийное обращение монета номиналом в пять рублей вошла только в 1991 году, во время денежной реформы в СССР. \n" +
                        "Современные пять рублей чеканятся с 1997 года Санкт-петербургским монетным двором и Московским монетным двором. Первоначально монета чеканилась из меди, плакированной мельхиором. В 2002 и 2016 годах был изменён аверс монет. В 2009 году начата чеканка монет из стали с никелевым гальванопокрытием. \n";
                break;
            case "10 рублей":
                this.info_text = "На первой пробной монете 1755 года императрицы Елизаветы Петровны достоинством в 10 рублей появилось первое официальное название “золотой”. Она имела надпись: “Елизаветин золотой”. В дальнейшем принятое внешнее оформление осталось неизменным на долгие годы. Монета получила название империал, которое появилось в связи с декларативной надписью: “Имперская российская монета”.\n" +
                        "10 рублей 1991 года чеканились на московском и ленинградском монетных дворах. Они имели две разновидности, отличающиеся написанием некоторых букв. \n" +
                        "С 1 октября 2009 года в России выпущена новая монета номиналом 10 рублей. Предполагалось, что к 2012 году она вытеснит из обращения бумажные банкноты того же номинала. \n";
                break;
        }
    }
}
